ycsb_result
mongo client connection created with mongodb://database:27017/ycsb
[OVERALL], RunTime(ms), 1672
[OVERALL], Throughput(ops/sec), 598.0861244019138
[TOTAL_GCS_G1_Young_Generation], Count, 2
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 34
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 2.0334928229665072
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 2
[TOTAL_GC_TIME], Time(ms), 34
[TOTAL_GC_TIME_%], Time(%), 2.0334928229665072
[READ], Operations, 484
[READ], AverageLatency(us), 6233.487603305785
[READ], MinLatency(us), 682
[READ], MaxLatency(us), 151167
[READ], 95thPercentileLatency(us), 9279
[READ], 99thPercentileLatency(us), 43263
[READ], Return=OK, 484
[CLEANUP], Operations, 8
[CLEANUP], AverageLatency(us), 484.875
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 3873
[CLEANUP], 95thPercentileLatency(us), 3873
[CLEANUP], 99thPercentileLatency(us), 3873
[UPDATE], Operations, 516
[UPDATE], AverageLatency(us), 4932.065891472868
[UPDATE], MinLatency(us), 670
[UPDATE], MaxLatency(us), 148095
[UPDATE], 95thPercentileLatency(us), 8551
[UPDATE], 99thPercentileLatency(us), 38015
[UPDATE], Return=OK, 516
mongo client connection created with mongodb://database:27017/ycsb
[OVERALL], RunTime(ms), 10038
[OVERALL], Throughput(ops/sec), 9006.67463638175
[TOTAL_GCS_G1_Young_Generation], Count, 44
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 114
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.1356843992827257
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 44
[TOTAL_GC_TIME], Time(ms), 114
[TOTAL_GC_TIME_%], Time(%), 1.1356843992827257
[READ], Operations, 45308
[READ], AverageLatency(us), 795.5312969012095
[READ], MinLatency(us), 183
[READ], MaxLatency(us), 154111
[READ], 95thPercentileLatency(us), 2415
[READ], 99thPercentileLatency(us), 5779
[READ], Return=OK, 45308
[CLEANUP], Operations, 8
[CLEANUP], AverageLatency(us), 2400.625
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 19199
[CLEANUP], 95thPercentileLatency(us), 19199
[CLEANUP], 99thPercentileLatency(us), 19199
[UPDATE], Operations, 45101
[UPDATE], AverageLatency(us), 760.9390922595951
[UPDATE], MinLatency(us), 192
[UPDATE], MaxLatency(us), 150655
[UPDATE], 95thPercentileLatency(us), 2329
[UPDATE], 99thPercentileLatency(us), 5567
[UPDATE], Return=OK, 45101